<!doctype html>




<html class="theme-next pisces">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />


















<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="工具,整理," />





  <link rel="alternate" href="/atom.xml" title="byAlice" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5DE5;&amp;#x6B32;&amp;#x5584;&amp;#x5176;&amp;#x4E8B;&amp;#xFF0C;&amp;#x5FC5;&amp;#x5148;&amp;#x5229;&amp;#x5176;&amp;#x5668;&amp;#xFF01;

&amp;#x524D;&amp;#x8A00;&amp;#x84E6;&amp;#x7136;&amp;#x56DE;&amp;#x9996;&amp;#xFF0C;&amp;#x53D1;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7E">
<meta property="og:type" content="article">
<meta property="og:title" content="浅谈“知识管理”、“工具收集”以及“开发环境的整理”">
<meta property="og:url" content="http://byalice.github.io/2016/09/10/Tool/index.html">
<meta property="og:site_name" content="byAlice">
<meta property="og:description" content="&amp;#x5DE5;&amp;#x6B32;&amp;#x5584;&amp;#x5176;&amp;#x4E8B;&amp;#xFF0C;&amp;#x5FC5;&amp;#x5148;&amp;#x5229;&amp;#x5176;&amp;#x5668;&amp;#xFF01;

&amp;#x524D;&amp;#x8A00;&amp;#x84E6;&amp;#x7136;&amp;#x56DE;&amp;#x9996;&amp;#xFF0C;&amp;#x53D1;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7E">
<meta property="og:updated_time" content="2016-09-10T14:27:49.099Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="浅谈“知识管理”、“工具收集”以及“开发环境的整理”">
<meta name="twitter:description" content="&amp;#x5DE5;&amp;#x6B32;&amp;#x5584;&amp;#x5176;&amp;#x4E8B;&amp;#xFF0C;&amp;#x5FC5;&amp;#x5148;&amp;#x5229;&amp;#x5176;&amp;#x5668;&amp;#xFF01;

&amp;#x524D;&amp;#x8A00;&amp;#x84E6;&amp;#x7136;&amp;#x56DE;&amp;#x9996;&amp;#xFF0C;&amp;#x53D1;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7E">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: false,
    motion: false,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://byalice.github.io/2016/09/10/Tool/"/>

  <title> 浅谈“知识管理”、“工具收集”以及“开发环境的整理” | byAlice </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?4bc51c9f226a5a158bcd229e57ac7284";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  <div style="display: none;">
    <script src="http://s6.cnzz.com/stat.php?id=1259511571&web_id=1259511571" type="text/javascript"></script>
  </div>





  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">byAlice</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'K6K_cwYFYcrxEdbG6Kvx','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                浅谈“知识管理”、“工具收集”以及“开发环境的整理”
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-10T11:26:12+08:00" content="2016-09-10">
              2016-09-10
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/Tool/" itemprop="url" rel="index">
                    <span itemprop="name">Tool</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/10/Tool/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/10/Tool/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/09/10/Tool/" class="leancloud_visitors" data-flag-title="浅谈“知识管理”、“工具收集”以及“开发环境的整理”">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#xFF0C;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#xFF01;</p>
</blockquote>
<h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><p>&#x84E6;&#x7136;&#x56DE;&#x9996;&#xFF0C;&#x53D1;&#x89C9;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x597D;&#x4E45;&#x6CA1;&#x5199;&#x535A;&#x5BA2;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6E90;&#x4E8E;&#x535A;&#x5BA2;&#x66F4;&#x65B0;&#x8D77;&#x6765;&#x8D39;&#x65F6;&#x8D39;&#x529B;&#xFF0C;&#x4E5F;&#x786E;&#x5B9E;&#xFF0C;&#x4ECE;&#x6784;&#x601D;&#x5230;&#x53D1;&#x5E03;&#x9700;&#x8981;&#x4E00;&#x5927;&#x628A;&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x4E9B;&#x4E3B;&#x9898;&#x4E5F;&#x662F;&#x88AB;&#x5927;&#x795E;&#x4EEC;&#x5199;&#x7684;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x91CD;&#x590D;&#x9020;&#x8F6E;&#x5B50;&#x4E86;&#xFF0C;&#x4E5F;&#x6216;&#x8BB8;&#x662F;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x603B;&#x4E4B;&#x4ECA;&#x5929;&#x5199;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x4E5F;&#x7B97;&#x662F;&#x5BF9;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x5176;&#x4E2D;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x63D2;&#x4EF6;&#x4E5F;&#x4FBF;&#x4E8E;&#x5DE5;&#x4F5C;&#x4EE5;&#x540E;&#x67E5;&#x627E;&#x4F7F;&#x7528;&#xFF01;</p>
<a id="more"></a>
<h2 id="&#x77E5;&#x8BC6;&#x7BA1;&#x7406;"><a href="#&#x77E5;&#x8BC6;&#x7BA1;&#x7406;" class="headerlink" title="&#x77E5;&#x8BC6;&#x7BA1;&#x7406;"></a>&#x77E5;&#x8BC6;&#x7BA1;&#x7406;</h2><p>&#x4FD7;&#x8BDD;&#x8BF4;&#xFF1A;&#x201C;&#x597D;&#x8BB0;&#x6027;&#x4E0D;&#x5982;&#x70C2;&#x7B14;&#x5934;&#x201D;&#xFF0C;&#x53EF;&#x89C1;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BB0;&#x7B14;&#x8BB0;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x7136;&#x800C;&#x5982;&#x4F55;&#x8BB0;&#x7B14;&#x8BB0;&#x624D;&#x80FD;&#x65B9;&#x4FBF;&#x4EE5;&#x540E;&#x7684;&#x67E5;&#x627E;&#xFF0C;&#x8BF4;&#x8BF4;&#x6211;&#x7684;&#x5386;&#x7A0B;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x524D;&#x7AEF;&#x77E5;&#x8BC6;&#xFF0C;&#x662F;&#x91C7;&#x7528;&#x4F20;&#x7EDF;&#x7684;&#x8BB0;&#x7B14;&#x8BB0;&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;&#x8BB0;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#xFF0C;&#x4EE3;&#x7801;&#x4E4B;&#x7C7B;&#x7684;&#x8FD8;&#x662F;&#x8981;&#x5728;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x4E2D;&#x8FD0;&#x884C;&#x8BD5;&#x8BD5;&#x6548;&#x679C;&#x7684;&#xFF0C;&#x4E4B;&#x540E;&#x968F;&#x7740;&#x7B14;&#x8BB0;&#x505A;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x518D;&#x60F3;&#x67E5;&#x8BE2;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x53EF;&#x5C31;&#x96BE;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5F88;&#x96BE;&#x8BB0;&#x6E05;&#x695A;&#x54EA;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x5728;&#x54EA;&#x4E00;&#x9875;&#x554A;&#xFF0C;&#x6709;&#x7FFB;&#x7B14;&#x8BB0;&#x672C;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x7F51;&#x4E0A;&#x6050;&#x6015;&#x65E9;&#x5C31;&#x641C;&#x5230;&#x4E86;&#xFF01;&#x53EF;&#x89C1;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6709;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x624D;&#x80FD;&#x4E8B;&#x534A;&#x529F;&#x500D;&#xFF0C;&#x52A0;&#x5FEB;&#x6548;&#x7387;&#xFF01;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x4E86;&#x4E91;&#x7B14;&#x8BB0;&#x4E4B;&#x7C7B;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x5C31;&#x662F;&#x628A;&#x7B14;&#x8BB0;&#x5199;&#x5728;&#x4E91;&#x7AEF;&#xFF0C;&#x628A;&#x7B14;&#x8BB0;&#x653E;&#x5728;&#x7F51;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x518D;&#x67E5;&#x627E;&#x65F6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6807;&#x7B7E;&#x5206;&#x7C7B;&#x5FEB;&#x901F;&#x67E5;&#x627E;&#x5230;&#xFF01;&#x5F53;&#x627E;&#x5230;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x5185;&#x5FC3;&#x91CC;&#x662F;&#x975E;&#x5E38;&#x6B23;&#x559C;&#x7684;&#xFF0C;&#x72B9;&#x5982;&#x53D1;&#x73B0;&#x4E86;&#x65B0;&#x5927;&#x9646;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4E0D;&#x7981;&#x53C8;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x4EE5;&#x524D;&#x505A;&#x7B14;&#x8BB0;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x591A;&#x4E48;low&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x662F;&#x8BF4;&#x7EB8;&#x8D28;&#x7B14;&#x8BB0;&#x5C31;&#x4E0D;&#x597D;&#xFF0C;&#x5404;&#x6709;&#x5343;&#x79CB;&#xFF0C;&#x7EB8;&#x8D28;&#x7B14;&#x8BB0;&#x4E0E;&#x4E91;&#x7B14;&#x8BB0;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x624D;&#x80FD;&#x6700;&#x5927;&#x5316;&#x4E3A;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x505A;&#x51FA;&#x6700;&#x5927;&#x8D21;&#x732E;&#xFF01;&#x4E0B;&#x9762;&#x6211;&#x5C31;&#x6765;&#x5B89;&#x5229;&#x4E00;&#x4E0B;&#x6700;&#x8FD1;&#x53D1;&#x73B0;&#x7684;&#x597D;&#x7528;&#x7684;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x7C7B;&#x5DE5;&#x5177;:</p>
<ul>
<li><p>&#x77E5;&#x8BC6;&#x6536;&#x96C6;&#x7C7B;</p>
<ul>
<li><a href="https://getpocket.com/" target="_blank" rel="external">Pocket</a>&#x3010;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x6587;&#x7AE0;&#x800C;&#x6682;&#x65F6;&#x6CA1;&#x65F6;&#x95F4;&#x9605;&#x8BFB;&#xFF0C;&#x5173;&#x95ED;&#x540E;&#x8BF4;&#x4E0D;&#x5B9A;&#x53C8;&#x627E;&#x4E0D;&#x5230;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x600E;&#x4E48;&#x529E;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x554A;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x60F3;&#x770B;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x770B;&#x7684;&#x7F51;&#x9875;&#x5B58;&#x5230;Pocekt&#x4E0A;&#xFF0C;&#x6709;&#x7A7A;&#x518D;&#x53BB;&#x770B;&#x54AF;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD9;&#x6B3E;&#x4EA7;&#x54C1;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x8FD8;&#x662F;&#x5F88;&#x68D2;&#x7684;&#x3011;</li>
<li><a href="http://shouquyunshuqian.lofter.com/" target="_blank" rel="external">&#x6536;&#x8DA3;&#x4E91;&#x6807;&#x7B7E;</a>&#x3010;&#x56FD;&#x5185;&#x7248;&#x7684;Pocket&#xFF0C;&#x754C;&#x9762;&#x4E4B;&#x7C7B;&#x4E5F;&#x8FD8;&#x591F;&#x5C0F;&#x6E05;&#x65B0;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x504F;&#x7231;Pocket&#x3011;</li>
</ul>
</li>
<li><p>&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x7C7B;</p>
<ul>
<li><a href="http://www.wiz.cn/" target="_blank" rel="external">&#x4E3A;&#x77E5;&#x7B14;&#x8BB0;</a>&#x3010;&#x66F4;&#x9002;&#x5408;&#x56FD;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x4E91;&#x7B14;&#x8BB0;<br>&#x591A;&#x7EA7;&#x76EE;&#x5F55;&#x3001;&#x591A;&#x7EA7;&#x6807;&#x7B7E;&#x3001;Markdown&#x3001;&#x65E0;&#x9650;&#x5B58;&#x8D2E;&#x7A7A;&#x95F4;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E4B;&#x6240;&#x4EE5;&#x6211;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x8FD9;&#x4E00;&#x6B3E;&#x4E91;&#x7B14;&#x8BB0;&#xFF0C;&#x6700;&#x5927;&#x539F;&#x56E0;&#x8FD8;&#x662F;&#x4ED6;&#x514D;&#x8D39;&#x554A;&#xFF0C;&#x800C;&#x4E14;markdown&#x652F;&#x6301;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x8BBE;&#x7F6E;&#x591A;&#x7EA7;&#x6807;&#x7B7E;&#x53CA;&#x5206;&#x7C7B;&#x540E;&#x5F88;&#x5BB9;&#x6613;&#x7BA1;&#x7406;&#x3011;</li>
<li><a href="https://www.yinxiang.com/" target="_blank" rel="external">&#x5370;&#x8C61;&#x7B14;&#x8BB0;</a>&#x3010;&#x53F7;&#x79F0;&#x201C;&#x8BB0;&#x4F4F;&#x4E00;&#x5207;<br>&#x73B0;&#x4EE3;&#x751F;&#x6D3B;&#x55A7;&#x56A3;&#x7E41;&#x6742;&#xFF0C;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x5E2E;&#x4F60;&#x8F7B;&#x677E;&#x7B80;&#x5316;&#x4E00;&#x5207;&#xFF0C;&#x8BA9;&#x751F;&#x6D3B;&#x66F4;&#x7F8E;&#x597D;&#xFF0C;&#x8BA9;&#x5DE5;&#x4F5C;&#x66F4;&#x7701;&#x529B;&#x201D;&#xFF0C;&#x4E0D;&#x8FC7;&#x786E;&#x5B9E;&#x4E5F;&#x6709;&#x8FD9;&#x4E2A;&#x5B9E;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x662F;&#x592A;&#x62A0;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;&#x5C31;&#x7ED9;60M&#x4E0A;&#x4F20;&#x6D41;&#x91CF;&#xFF0C;&#x90A3;&#x80FD;&#x591F;&#x5417;&#xFF1F;&#x800C;&#x4E14;&#x8FD8;&#x6CA1;&#x6709;&#x5185;&#x7F6E;markdown&#x3011;</li>
<li><a href="http://note.youdao.com/" target="_blank" rel="external">&#x6709;&#x9053;&#x4E91;&#x7B14;&#x8BB0;</a>&#x3010;&#x7F51;&#x6613;&#x51FA;&#x54C1;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x79CD;Office&#x6587;&#x6863;&#xFF0C;&#x529E;&#x516C;&#x5BA4;&#x968F;&#x8EAB;&#x643A;&#x5E26;&#x3011;</li>
<li><a href="https://simplenote.com/" target="_blank" rel="external">Simplenote</a>&#x3010;&#x4E00;&#x6B3E;&#x5F88;&#x5C0F;&#x4F17;&#x7684;&#x4E91;&#x7B14;&#x8BB0;&#xFF0C;&#x6B63;&#x5982;&#x5176;&#x540D;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5C0F;&#x5DE7;&#xFF0C;&#x9002;&#x5408;&#x65E5;&#x5E38;&#x8BB0;&#x4E8B;&#xFF0C;&#x6B63;&#x5982;&#x5468;&#x5029;&#x5982;&#x5927;&#x795E;&#x5728;&#x300A;&#x975E;&#x4F60;&#x83AB;&#x5C5E;&#x300B;&#x4E0A;&#x8BE0;&#x91CA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4E00;&#x6B3E;&#x597D;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#xFF0C;&#x201C;&#x4F60;&#x8981;&#x628A;&#x4E92;&#x8054;&#x7F51;&#x7528;&#x6237;&#x60F3;&#x8C61;&#x6210;&#x667A;&#x5546;&#x975E;&#x5E38;&#x4F4E;&#xFF0C;&#x813E;&#x6C14;&#x975E;&#x5E38;&#x5DEE;&#xFF0C;&#x8D85;&#x7EA7;&#x6CA1;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x800C;&#x4E14;&#x8D85;&#x7EA7;&#x5C0F;&#x6C14;&#xFF0C;&#x4E0D;&#x80AF;&#x51FA;&#x4E00;&#x5206;&#x94B1;&#x7684;&#x4EBA;&#x201D;&#x53EA;&#x8981;&#x628A;&#x8FD9;&#x79CD;&#x4EBA;&#x7ED9;&#x4F3A;&#x5019;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EA7;&#x54C1;&#x624D;&#x4F1A;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x6210;&#x529F;&#x5427;&#xFF01;&#x3011;</li>
</ul>
</li>
</ul>
<p>&#x4E0A;&#x8FF0;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#xFF0C;pc&#x7AEF;&#x79FB;&#x52A8;&#x7AEF;&#x90FD;&#x6709;&#xFF01;&#x7531;&#x4E8E;&#x662F;&#x4FDD;&#x5B58;&#x5728;&#x4E91;&#x7AEF;&#xFF0C;&#x4F55;&#x65F6;&#x4F55;&#x5730;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7EC8;&#x7AEF;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#xFF01;</p>
<h2 id="&#x524D;&#x7AEF;&#x8D44;&#x8BAF;"><a href="#&#x524D;&#x7AEF;&#x8D44;&#x8BAF;" class="headerlink" title="&#x524D;&#x7AEF;&#x8D44;&#x8BAF;"></a>&#x524D;&#x7AEF;&#x8D44;&#x8BAF;</h2><ul>
<li><a href="https://www.zhihu.com/" target="_blank" rel="external">&#x77E5;&#x4E4E;</a>&#x3010;&#x5927;&#x725B;&#x51FA;&#x6CA1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x4E16;&#x754C;&#x3011;</li>
<li><a href="http://gold.xitu.io/" target="_blank" rel="external">&#x6398;&#x91D1;</a>&#x3010;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6280;&#x672F;&#x793E;&#x533A;&#x3011;</li>
<li><a href="https://segmentfault.com/" target="_blank" rel="external">SegmentFault</a>&#x3010;SegmentFault &#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x6CE8;&#x4E8E;&#x89E3;&#x51B3;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6280;&#x80FD;&#x7684;&#x793E;&#x533A;&#x3002;&#x3011;</li>
<li><a href="http://toutiao.io/" target="_blank" rel="external">&#x5F00;&#x53D1;&#x8005;&#x5934;&#x6761;</a>&#x3010;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x5934;&#x6761;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x5934;&#x6761;&#x65B0;&#x95FB;&#x3001;&#x5206;&#x4EAB;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x3001;&#x53D1;&#x5E03;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x8BA2;&#x9605;&#x6280;&#x672F;&#x6781;&#x5BA2;/&#x6280;&#x672F;&#x56E2;&#x961F;&#x5F00;&#x901A;&#x7684;&#x72EC;&#x5BB6;&#x53F7;/&#x56E2;&#x961F;&#x53F7;&#x548C;&#x5173;&#x6CE8;&#x7F16;&#x7A0B;&#x725B;&#x4EBA;&#x3002;&#x3011;</li>
<li><a href="http://stackoverflow.com/" target="_blank" rel="external">stackoverflow</a>&#x3010;Stack Overflow&#x662F;&#x4E00;&#x4E2A;&#x4E0E;&#x7A0B;&#x5E8F;&#x76F8;&#x5173;&#x7684;IT&#x6280;&#x672F;&#x95EE;&#x7B54;&#x7F51;&#x7AD9;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7AD9;&#x514D;&#x8D39;&#x63D0;&#x4EA4;&#x95EE;&#x9898;&#xFF0C;&#x6D4F;&#x89C8;&#x95EE;&#x9898;&#xFF0C;&#x7D22;&#x5F15;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#xFF0C;&#x5168;&#x90FD;&#x662F;&#x82F1;&#x6587;&#xFF01;&#xFF01;&#xFF01;&#x3011;</li>
</ul>
<h2 id="PC&#x7AEF;"><a href="#PC&#x7AEF;" class="headerlink" title="PC&#x7AEF;"></a>PC&#x7AEF;</h2><p>&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x662F;window&#x7CFB;&#x7EDF;&#xFF0C;&#x6545;&#x63A8;&#x8350;&#x7684;&#x662F;&#x4E00;&#x4E9B;window&#x4E0B;&#x7684;&#x5E94;&#x7528;</p>
<h3 id="&#x5C0F;&#x5DE5;&#x5177;"><a href="#&#x5C0F;&#x5DE5;&#x5177;" class="headerlink" title="&#x5C0F;&#x5DE5;&#x5177;"></a>&#x5C0F;&#x5DE5;&#x5177;</h3><ul>
<li><a href="https://maxiang.io/" target="_blank" rel="external">&#x9A6C;&#x514B;&#x98DE;&#x8C61;</a>&#x3010;markdown&#x7F16;&#x8F91;&#x5668;&#x3011;</li>
<li><a href="http://www.egouz.com/topics/10805.html" target="_blank" rel="external">MIU</a>&#x3010;markdown&#x7F16;&#x8F91;&#x5668;&#x3011;</li>
<li><a href="http://www.getmarkman.com/" target="_blank" rel="external">Mark Man</a>&#x3010;&#x9AD8;&#x6548;&#x7684;&#x8BBE;&#x8BA1;&#x7A3F;&#x6807;&#x6CE8;&#x3001;&#x6D4B;&#x91CF;&#x5DE5;&#x5177;&#x3011;</li>
<li><a href="http://www.appinn.com/color-cube/" target="_blank" rel="external">ColorCube</a>&#x3010;Color Cube &#x662F;&#x9762;&#x5411;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x914D;&#x8272;&#x53D6;&#x8272;&#x5DE5;&#x5177;&#x3011;</li>
<li><a href="http://www.xiazaiba.com/html/1883.html" target="_blank" rel="external">ColorPix</a>&#x3010;ColorPix&#x662F;&#x4E00;&#x6B3E;&#x5E2E;&#x52A9;&#x4F60;&#x5FEB;&#x901F;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x53D6;&#x8272;&#x7684;&#x5DE5;&#x5177;.&#x5E76;&#x4E14;&#x80FD;&#x6839;&#x636E;&#x4F60;&#x53D6;&#x7684;&#x989C;&#x8272;&#x5F97;&#x5230;Pixel&#x3001;RGB&#x3001;HEX&#x3001;HSB&#x3001;CMYK&#x4EE3;&#x7801;.&#x6253;&#x5F00;&#x8F6F;&#x4EF6;&#x540E;&#xFF0C;&#x9F20;&#x6807;&#x7ECF;&#x8FC7;&#x7684;&#x5730;&#x65B9;&#x5373;&#x4E3A;ColorPix&#x53D6;&#x8272;&#x7684;&#x533A;&#x57DF;.&#x3011;</li>
<li><a href="http://rj.baidu.com/soft/detail/13504.html?ald" target="_blank" rel="external">FastStone Capture</a>&#x3010;FastStone Screen Capture (FSCapture) &#x662F;&#x4E00;&#x6B3E;&#x514D;&#x8D39;&#x7684;&#x56FE;&#x50CF;&#x6D4F;&#x89C8;&#x3001;&#x7F16;&#x8F91;&#x548C;&#x6293;&#x5C4F;&#x5DE5;&#x5177;&#xFF0C;&#x652F;&#x6301;&#x5305;&#x62EC;BMP, JPEG, JPEG 2000, GIF, PNG, PCX, TIFF, WMF, ICO &#x548C;TGA&#x5728;&#x5185;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x6D41;&#x56FE;&#x7247;&#x683C;&#x5F0F;&#xFF0C;&#x5176;&#x72EC;&#x6709;&#x7684;&#x5149;&#x6ED1;&#x548C;&#x6BDB;&#x523A;&#x5904;&#x7406;&#x6280;&#x672F;&#x8BA9;&#x56FE;&#x7247;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#xFF0C;&#x63D0;&#x4F9B;&#x7F29;&#x653E;&#x3001;&#x65CB;&#x8F6C;&#x3001;&#x51CF;&#x5207;&#x3001;&#x989C;&#x8272;&#x8C03;&#x6574;&#x529F;&#x80FD;&#x3002;&#x53EA;&#x8981;&#x70B9;&#x70B9;&#x9F20;&#x6807;&#x5C31;&#x80FD;&#x968F;&#x5FC3;&#x6293;&#x53D6;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x62D6;&#x653E;&#x652F;&#x6301;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x7CFB;&#x7EDF;&#x3001;&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BFC;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x6536;&#x85CF;&#x5939;&#x529F;&#x80FD;&#x8BA9;&#x4F60;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x4ECE;eNet&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7CBE;&#x5F69;&#x56FE;&#x7247;&#x3002;&#x3011;</li>
<li><a href="http://www.appinn.com/licecap/" target="_blank" rel="external">LiceCap</a>&#x3010;LICEcap &#x662F;&#x4E00;&#x6B3E;&#x5C4F;&#x5E55;&#x5F55;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x652F;&#x6301;&#x5BFC;&#x51FA; GIF &#x52A8;&#x753B;&#x56FE;&#x7247;&#x683C;&#x5F0F;&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x3001;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#xFF0C;&#x5F55;&#x5236;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x6539;&#x53D8;&#x5F55;&#x5C4F;&#x8303;&#x56F4;&#x3011;</li>
<li><a href="http://www.yingsuowang.com/" target="_blank" rel="external">shadowsocks</a>&#x3010;&#x914D;&#x5408;<a href="http://www.ishadowsocks.org/" target="_blank" rel="external">&#x514D;&#x8D39;&#x8D26;&#x53F7;</a>&#x7FFB;&#x5899;&#x3011;</li>
<li><a href="http://www.2ilt.com/" target="_blank" rel="external">Lantern</a>&#x3010;&#x7FFB;&#x5899;&#x3011;</li>
<li><a href="https://github.com/byAlice" target="_blank" rel="external">github&#x5BA2;&#x6237;&#x7AEF;</a>&#x3010;&#x4EE3;&#x7801;&#x7BA1;&#x7406;&#x3011;</li>
<li><a href="">git shell</a>&#x3010;git&#x547D;&#x4EE4;&#x884C;&#x3011;</li>
<li><a href="">git bash</a>&#x3010;git&#x547D;&#x4EE4;&#x884C;&#x3011;</li>
<li><a href="">Flashfxp</a>&#x3010;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x3011;</li>
<li><a href="http://rj.baidu.com/soft/detail/17239.html?ald" target="_blank" rel="external">Everything</a>&#x3010;Everything&#x662F;&#x4E00;&#x6B3E;&#x6587;&#x4EF6;&#x3001;&#x6587;&#x4EF6;&#x5939;&#x540D;&#x79F0;&#x5FEB;&#x901F;&#x641C;&#x7D22;&#x8F6F;&#x4EF6;&#x3002;&#x5728;&#x641C;&#x7D22;&#x4E4B;&#x524D;&#x5C31;&#x4F1A;&#x628A;&#x6240;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x6587;&#x4EF6;&#x5939;&#x90FD;&#x5217;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E0E;Windows&#x81EA;&#x5E26;&#x7684;&#x641C;&#x7D22;&#x7CFB;&#x7EDF;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x79F0;&#x4E4B;Everything&#x3002;&#x5728;&#x641C;&#x7D22;&#x6846;&#x8F93;&#x5165;&#x6587;&#x5B57;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x53EA;&#x663E;&#x793A;&#x8FC7;&#x6EE4;&#x540E;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x3011;</li>
<li><a href="http://rj.baidu.com/soft/detail/17870.html?ald" target="_blank" rel="external">Clover</a>&#x3010;Clover&#x662F;&#x4E00;&#x6B3E;&#x514D;&#x8D39;&#x5B9E;&#x7528;&#x7684;&#x589E;&#x5F3A;&#x5C0F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B83;&#x80FD;&#x4E3A;&#x4F60;&#x7684; Windows Explorer &#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#xFF08;&#x6216;&#x8005;&#x901A;&#x4FD7;&#x70B9;&#x8BF4;&#x662F;&#x201C;&#x6211;&#x7684;&#x7535;&#x8111;&#x201D;&#xFF09;&#x589E;&#x52A0;&#x591A;&#x6807;&#x7B7E;&#x9875;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x50CF;&#x8C37;&#x6B4C; Chrome &#x6D4F;&#x89C8;&#x5668;&#x90A3;&#x6837;&#x65B9;&#x4FBF;&#x597D;&#x7528;&#x3002;&#x5728;&#x540C;&#x65F6;&#x67E5;&#x770B;/&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x8DEF;&#x5F84;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x65F6;&#x5C24;&#x4E3A;&#x65B9;&#x4FBF;&#xFF0C;&#x8BA9;&#x7A97;&#x53E3;&#x66F4;&#x5C11;&#x66F4;&#x6574;&#x6D01;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x652F;&#x6301;&#x5FEB;&#x6377;&#x952E;&#x4E0E;&#x6807;&#x7B7E;&#x9875;&#x7684;&#x62D6;&#x5165;&#x62D6;&#x51FA;&#xFF0C;&#x719F;&#x6089;&#x4F7F;&#x7528;&#x4E4B;&#x540E;&#x7EDD;&#x5BF9;&#x80FD;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x7535;&#x8111;&#x64CD;&#x4F5C;&#x7684;&#x6548;&#x7387;&#x3002;&#x3011;</li>
<li><a href="http://www.wps.cn/" target="_blank" rel="external">WPS</a>&#x3010;WPS&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x529E;&#x516C;&#x8F6F;&#x4EF6;&#x6700;&#x5E38;&#x7528;&#x7684;&#x6587;&#x5B57;&#x3001;&#x8868;&#x683C;&#x3001;&#x6F14;&#x793A;&#x7B49;&#x591A;&#x79CD;&#x529F;&#x80FD;&#x3002;&#x5177;&#x6709;&#x5185;&#x5B58;&#x5360;&#x7528;&#x4F4E;&#x3001;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x5FEB;&#x3001;&#x4F53;&#x79EF;&#x5C0F;&#x5DE7;&#x3001;&#x5F3A;&#x5927;&#x63D2;&#x4EF6;&#x5E73;&#x53F0;&#x652F;&#x6301;&#x3011;</li>
<li><a href="http://rj.baidu.com/soft/detail/11403.html?ald" target="_blank" rel="external">&#x91D1;&#x5C71;&#x6253;&#x5B57;&#x901A;</a>&#x3010;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#x62EF;&#x6551;&#x4E86;&#x6211;&#x7684;&#x6253;&#x5B57;&#x901F;&#x5EA6;&#xFF0C;&#x4F9D;&#x9760;&#x6BCF;&#x5929;&#x7684;&#x575A;&#x6301;&#x7EC3;&#x4E60;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x662F;&#x5F53;&#x5E74;&#x7684;&#x2019;&#x4E00;&#x6307;&#x7985;&#x2019;&#x3011;</li>
</ul>
<h3 id="&#x5F00;&#x53D1;&#x5DE5;&#x5177;"><a href="#&#x5F00;&#x53D1;&#x5DE5;&#x5177;" class="headerlink" title="&#x5F00;&#x53D1;&#x5DE5;&#x5177;"></a>&#x5F00;&#x53D1;&#x5DE5;&#x5177;</h3><ul>
<li><a href="https://www.jetbrains.com/webstorm/" target="_blank" rel="external">webstorm</a>&#x3010;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x867D;&#x7136;&#x542F;&#x52A8;&#x6162;&#x70B9;&#xFF0C;js&#x81EA;&#x52A8;&#x8865;&#x5168;&#x65B9;&#x9762;&#x8FD8;&#x6709;&#x5F85;&#x63D0;&#x9AD8;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x90FD;&#x8FD8;&#x633A;&#x597D;&#x7684;&#x3011;</li>
<li><a href="https://atom.io/" target="_blank" rel="external">Atom</a>&#x3010;&#x754C;&#x9762;&#x53CB;&#x597D;&#xFF0C;&#x63D2;&#x4EF6;&#x4E30;&#x5BCC;&#xFF0C;&#x903C;&#x683C;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x662F;&#x5361;&#x554A;&#x5361;&#x554A;&#x5361;&#x554A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5361;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x4ED6;&#x3011;</li>
<li><a href="http://www.sublimetext.com/3" target="_blank" rel="external">sublime Text3</a>&#x3010;&#x4E00;&#x5EA6;&#x88AB;&#x6367;&#x5411;&#x795E;&#x575B;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#x4E5F;&#x662F;&#x5361;&#xFF0C;&#x96BE;&#x9053;&#x662F;&#x7535;&#x8111;&#x95EE;&#x9898;&#x3011;</li>
<li><a href="http://rj.baidu.com/soft/detail/13478.html?ald" target="_blank" rel="external">Notepad++</a>/<a href="http://rj.baidu.com/soft/detail/10069.html?ald" target="_blank" rel="external">EmEditor</a>&#x3010;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x53D6;&#x4EE3;&#x7535;&#x8111;&#x81EA;&#x5E26;&#x7684;&#x8BB0;&#x4E8B;&#x672C;&#x7684;&#x529F;&#x80FD;&#x3011;</li>
<li><a href="">photoshop CC</a>&#x3010;&#x56FE;&#x7247;&#x5904;&#x7406;&#x5FC5;&#x5907;&#xFF0C;&#x6700;&#x8FD1;&#x4E34;&#x8FD1;&#x5B9E;&#x4E60;&#xFF0C;&#x4E0D;&#x5C11;&#x670B;&#x53CB;&#x90FD;&#x8BF7;&#x6211;&#x5E2E;&#x4ED6;&#x4EEC;&#x4FEE;&#x56FE;&#x7247;&#xFF0C;&#x505A;&#x8BC1;&#x4EF6;&#x7167;&#xFF0C;&#x8FD8;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x4F1A;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x7B11;&#x800C;&#x4E0D;&#x8BED;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5FC3;&#x91CC;&#x60F3;&#x4E86;&#x60F3;&#x201C;&#x4F60;&#x4EEC;&#x600E;&#x4E48;&#x4E0D;&#x60F3;&#x60F3;&#x4F60;&#x4EEC;&#x65E0;&#x804A;&#x65F6;&#x6597;&#x5730;&#x4E3B;&#xFF0C;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x95F2;&#x804A;&#x7684;&#x65F6;&#x5019;&#xFF1B;&#x6211;&#x90FD;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x65E5;&#x79EF;&#x6708;&#x7D2F;&#x4E0B;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4F1A;&#x4EA7;&#x751F;&#x8D28;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x52A0;&#x6CB9;&#xFF01;&#x201D;&#x3011;</li>
</ul>
<h3 id="&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;"><a href="#&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;" class="headerlink" title="&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;"></a>&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;</h3><h4 id="chrome&#x63D2;&#x4EF6;"><a href="#chrome&#x63D2;&#x4EF6;" class="headerlink" title="chrome&#x63D2;&#x4EF6;"></a>chrome&#x63D2;&#x4EF6;</h4><h5 id="&#x5E38;&#x7528;&#x63D2;&#x4EF6;"><a href="#&#x5E38;&#x7528;&#x63D2;&#x4EF6;" class="headerlink" title="&#x5E38;&#x7528;&#x63D2;&#x4EF6;"></a>&#x5E38;&#x7528;&#x63D2;&#x4EF6;</h5><ul>
<li><a href="">&#x4E00;&#x952E;&#x7BA1;&#x7406;&#x6240;&#x6709;&#x6269;&#x5C55;</a>&#x3010;&#x65B9;&#x4FBF;&#x7BA1;&#x7406;&#x4E0B;&#x8F7D;&#x7684;&#x63D2;&#x4EF6;&#x3011;</li>
<li><p><a href="">onetab</a>&#x3010;&#x50CF;&#x4E00;&#x4E2A;&#x6F0F;&#x6597;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x7531;&#x4E8E;Chrome&#x6BCF;&#x4E2A;&#x6807;&#x7B7E;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x8FDB;&#x7A0B;&#xFF0C;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x5185;&#x5B58;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x7535;&#x8111;&#x4E0D;&#x65AD;&#x53D8;&#x6162;&#x3002;OneTab &#x6269;&#x5C55;&#x53EF;&#x4E3A;&#x4F60;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x4E0B;&#x6269;&#x5C55;&#x56FE;&#x6807;&#xFF0C;&#x5C31;&#x4F1A;&#x5C06;&#x4F60;&#x6253;&#x5F00;&#x7684;&#x6807;&#x7B7E;&#x805A;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x53EA;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x3002;<br>&#x5F53;&#x4F60;&#x5B58;&#x5728;&#x6253;&#x5F00;&#x591A;&#x4E2A;&#x7A97;&#x4F53;&#xFF0C;&#x751A;&#x81F3;&#x5F88;&#x4E71;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x59A8;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E34;&#x65F6;&#x6536;&#x7F29;&#x4E00;&#x4E0B;&#x4F60;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7A97;&#x4F53;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x80FD;&#x6781;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x8C37;&#x6B4C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6027;&#x80FD;&#x4EE5;&#x53CA;&#x4F60;&#x7684;&#x6D4F;&#x89C8;&#x6548;&#x7387;&#x3002;&#x3011;</p>
</li>
<li><p><a href="">Adblock/&#x5E7F;&#x544A;&#x7EC8;&#x7ED3;&#x8005;</a>&#x3010;&#x53BB;&#x9664;&#x9875;&#x9762;&#x4E0A;&#x90A3;&#x4E9B;&#x70E6;&#x4EBA;&#x7684;&#x5E7F;&#x544A;&#x5427;&#xFF01;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x53BB;&#x9664;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x524D;&#x90A3;&#x5197;&#x957F;&#x7684;60s&#x7684;&#x5E7F;&#x544A;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x68D2;&#xFF01;&#x3011;</p>
</li>
<li><a href="">chrono&#x4E0B;&#x8F7D;&#x7BA1;&#x7406;&#x5668;</a>&#x3010;&#x65B9;&#x4FBF;&#x7BA1;&#x7406;&#x4E0B;&#x8F7D;&#x7684;&#x5185;&#x5BB9;&#x3011;</li>
<li><a href="">page ruler</a>&#x3010;&#x65B9;&#x4FBF;&#x6D4B;&#x91CF;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x5C3A;&#x5BF8;&#x3011;</li>
<li><a href="">Color Zilla</a>&#x3010;&#x65B9;&#x4FBF;&#x6D4B;&#x91CF;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x989C;&#x8272;&#x3011;</li>
<li><a href="">Clear Cache</a>&#x3010;&#x6E05;&#x7F13;&#x5B58;&#x3011;</li>
<li><a href="">live reload</a>&#x3010;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x540E;&#x81EA;&#x52A8;&#x5237;&#x65B0;&#x3011;</li>
<li><a href="">save to pocket</a>&#x3010;&#x4FDD;&#x5B58;&#x5230;pocket&#x3011;</li>
<li><a href="">&#x526A;&#x85CF;&#x5230;&#x5370;&#x8C61;&#x7B14;&#x8BB0;</a>&#x3010;&#x526A;&#x85CF;&#x5230;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x3011;</li>
<li><a href="">&#x4E3A;&#x77E5;&#x7B14;&#x8BB0;&#x7F51;&#x9875;&#x526A;&#x8F91;&#x5668;</a>&#x3010;&#x526A;&#x8F91;&#x7F51;&#x9875;&#x5230;&#x4E3A;&#x77E5;&#x7B14;&#x8BB0;&#x3011;</li>
<li><a href="">&#x6709;&#x9053;&#x4E91;&#x7B14;&#x8BB0;&#x7F51;&#x9875;&#x526A;&#x62A5;</a>&#x3010;&#x526A;&#x8F91;&#x7F51;&#x9875;&#x5230;&#x6709;&#x9053;&#x4E91;&#x7B14;&#x8BB0;&#x3011;</li>
<li><a href="">UC&#x4E8C;&#x7EF4;&#x7801;</a>&#x3010;&#x65B9;&#x4FBF;&#x5C06;&#x7F51;&#x9875;&#x751F;&#x6210;&#x4E8C;&#x7EF4;&#x7801;&#x3011;</li>
<li><a href="">simpleUndoClose</a>&#x3010;&#x64A4;&#x9500;&#x5173;&#x95ED;&#x7684;&#x7F51;&#x9875;&#x3011;</li>
<li><a href="">LassPass</a>&#x3010;&#x5BC6;&#x7801;&#x7BA1;&#x7406;&#x63D2;&#x4EF6;&#x3011;</li>
<li><a href="">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a>&#x3010;&#x65B9;&#x4FBF;&#x7FFB;&#x8BD1;&#x82F1;&#x6587;&#x7F51;&#x9875;&#x3011;</li>
<li><a href="">open InternetSpeedTracker New Tab</a>&#x3010;&#x6253;&#x5F00;&#x7279;&#x5B9A;&#x7684;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x7FFB;&#x5899;&#x540E;&#x53EF;&#x8C37;&#x6B4C;&#x641C;&#x7D22;&#x3011;</li>
</ul>
<h5 id="&#x5907;&#x7528;&#x63D2;&#x4EF6;"><a href="#&#x5907;&#x7528;&#x63D2;&#x4EF6;" class="headerlink" title="&#x5907;&#x7528;&#x63D2;&#x4EF6;"></a>&#x5907;&#x7528;&#x63D2;&#x4EF6;</h5><ul>
<li><a href="">AutoPagerize</a>&#x3010;&#x81EA;&#x52A8;&#x7FFB;&#x9875;&#x63D2;&#x4EF6;&#x3011;</li>
<li><a href="">CSSViewer</a>&#x3010;css&#x6837;&#x5F0F;&#x67E5;&#x770B;&#x5668;&#x3011;</li>
<li><a href="">FontfaceNinja</a>&#x3010;&#x7F51;&#x9875;&#x5B57;&#x4F53;&#x67E5;&#x8BE2;&#x5C0F;&#x5E2E;&#x624B;&#x3011;</li>
<li><a href="">IETab</a>&#x3010;&#x8BBF;&#x95EE;&#x67D0;&#x4E9B;&#x53EA;&#x652F;&#x6301; IE &#x767B;&#x5F55;&#x7684;&#x7F51;&#x7AD9;&#x65F6;&#x53EF;&#x4EE5;&#x5728;Chrome&#x4E2D;&#x4F7F;&#x7528; IE Tab &#x6253;&#x5F00;&#x3011;</li>
<li><a href="">Test IE</a>&#x3010;&#x6D4B;&#x8BD5;&#x7F51;&#x9875;&#x5728;IE&#x8001;&#x7248;&#x672C;&#x4E2D;&#x7684;&#x6548;&#x679C;&#x3011;</li>
<li><a href="">Imagus</a>&#x3010;&#x57FA;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x56FE;&#x7247;&#x589E;&#x5F3A;&#x6269;&#x5C55;&#x5DE5;&#x5177;&#x662F;&#x4E00;&#x6B3E;&#x652F;&#x6301;Opera&#x3001;Firefox&#x3001;Chrome&#x3001;Safari&#x3001;Maxthon&#x7B49;&#x4E3B;&#x6D41;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6269;&#x5C55;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x7EBF;&#x5904;&#x7406;&#x5404;&#x79CD;&#x56FE;&#x7247;&#xFF0C;&#x652F;&#x6301;&#x5BF9;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x9884;&#x89C8;&#x3001;&#x653E;&#x5927;&#x7F29;&#x5C0F;&#x3001;&#x65CB;&#x8F6C;&#x7B49;&#x64CD;&#x4F5C;&#x3002;&#x3011;</li>
<li><a href="">Isometric Contributions</a>&#x3010;&#x5B83;&#x53EF;&#x4EE5;&#x5C06; Chrome &#x548C; Safari &#x6D4F;&#x89C8;&#x5668;&#x4E0A; Github &#x7684;&#x56FE;&#x8868;&#x8F6C;&#x6362;&#x6210;&#x7ACB;&#x4F53;&#x7684;&#x50CF;&#x7D20;&#x98CE;&#x683C;&#x3002;&#x3011;</li>
<li><a href="">Octotree</a>&#x3010;&#x7528;&#x6765;&#x663E;&#x793A; Github &#x9879;&#x76EE;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x3011;</li>
<li><a href="">Perfmap</a>&#x3010;&#x3000;PerfMap &#x662F;&#x7528;&#x6765;&#x5206;&#x6790;&#x524D;&#x7AEF;&#x6027;&#x80FD;&#xFF0C;&#x57FA;&#x4E8E;&#x8D44;&#x6E90;&#x5B9A;&#x65F6; API &#x751F;&#x6210;&#x7F51;&#x9875;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x7684;&#x524D;&#x7AEF;&#x6027;&#x80FD;&#x70ED;&#x56FE;&#x3002;&#x70ED;&#x56FE;&#x7684;&#x989C;&#x8272;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x6BEB;&#x79D2;&#x503C;&#x6307;&#x793A;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9875;&#x9762;&#x7684;&#x56FE;&#x50CF;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6307;&#x6807;&#x3002;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x503C;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x52A0;&#x8F7D;&#x7279;&#x5B9A;&#x56FE;&#x50CF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x3011;</li>
<li><a href="">postman</a>&#x3010;Postman&#x662F;&#x4E00;&#x6B3E;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x9875;&#x8C03;&#x8BD5;&#x4E0E;&#x53D1;&#x9001;&#x7F51;&#x9875;HTTP&#x8BF7;&#x6C42;&#x7684;Chrome&#x63D2;&#x4EF6;&#x3002;&#x3011;</li>
<li><a href="">Proxy Switchsharp</a>&#x3010;&#x9488;&#x5BF9;&#x8C37;&#x6B4C;&#x6D4F;&#x89C8;&#x5668;&#x800C;&#x5F00;&#x53D1;&#x7684;&#x4E00;&#x6B3E;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#x63D2;&#x4EF6;&#x3011;</li>
<li><a href="">Tampermonkey Beta</a>&#x3010;Tampermonkey&#x901A;&#x8FC7;&#x52A0;&#x8F7D;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;&#xFF0C;&#x6539;&#x53D8;&#x9875;&#x9762;&#x4E2D;&#x7684;CSS&#x548C;JS&#x5143;&#x7D20;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6574;&#x4E2A;&#x7F51;&#x9875;&#x5927;&#x53D8;&#x6837;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x589E;&#x52A0;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x3002;&#x3011;</li>
<li><a href="">FeHelper</a>&#x3010;&#x5305;&#x62EC;&#x5B57;&#x7B26;&#x4E32;&#x7F16;&#x89E3;&#x7801;&#x3001;&#x4EE3;&#x7801;&#x7F8E;&#x5316;&#x3001;JSON&#x683C;&#x5F0F;&#x5316;&#x3001;&#x4E8C;&#x7EF4;&#x7801;&#x751F;&#x6210;&#x5668;&#x3001;&#x7F16;&#x7801;&#x89C4;&#x8303;&#x68C0;&#x6D4B;&#x3001;&#x9875;&#x9762;&#x6027;&#x80FD;&#x68C0;&#x6D4B;&#x3001;&#x6805;&#x683C;&#x68C0;&#x6D4B;&#x7B49;&#x3011;</li>
<li><a href="">window Resizer</a>&#x3010;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x8C03;&#x8282;&#x63D2;&#x4EF6;&#x3011;</li>
<li><a href="">&#x4E00;&#x952E;&#x5207;&#x6362;</a>&#x3010;&#x641C;&#x7D22;&#x5185;&#x5BB9;&#x662F;&#x53EF;&#x4E00;&#x952E;&#x5207;&#x6362;&#x5230;&#x767E;&#x5EA6;&#x3001;&#x8C37;&#x6B4C;&#x3001;&#x5FC5;&#x5E94;&#xFF0C;&#x7701;&#x53BB;&#x7C98;&#x8D34;&#x590D;&#x5236;&#x7684;&#x7E41;&#x7410;&#x8FC7;&#x7A0B;&#x3011;</li>
<li><a href="">&#x601D;&#x7EF4;&#x5BFC;&#x56FE;</a>&#x3010;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x7ED8;&#x56FE;&#x8F6F;&#x4EF6;&#x6709;&#x7740;&#x76F4;&#x89C2;,&#x53CB;&#x597D;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x548C;&#x4E30;&#x5BCC;&#x7684;&#x529F;&#x80FD;,&#x8FD9;&#x5C06;&#x5E2E;&#x52A9;&#x60A8;&#x6709;&#x5E8F;&#x5730;&#x7EC4;&#x7EC7;&#x60A8;&#x7684;&#x601D;&#x7EF4;,&#x8D44;&#x6E90;&#x548C;&#x9879;&#x76EE;&#x8FDB;&#x7A0B;&#x3011;</li>
<li><a href="">&#x6398;&#x91D1;</a>&#x3010;&#x524D;&#x7AEF;&#x8D44;&#x8BAF;&#x3011;</li>
<li><a href="">&#x7F51;&#x9875;&#x622A;&#x56FE;&#x6CE8;&#x91CA;&amp;&#x6279;&#x6CE8;</a>&#x3010;&#x7F51;&#x9875;&#x622A;&#x56FE;&#x6CE8;&#x91CA;&amp;&#x6279;&#x6CE8;&#x3011;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5907;&#x7528;&#x63D2;&#x4EF6;&#x5E73;&#x65F6;&#x662F;&#x7ED9;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;Chrome&#x6BCF;&#x4E2A;&#x6807;&#x7B7E;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E48;&#x591A;&#x63D2;&#x4EF6;&#x4E00;&#x8D77;&#x8FD0;&#x884C;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x5185;&#x5B58;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x7535;&#x8111;&#x4E0D;&#x65AD;&#x53D8;&#x6162;&#xFF01;</p>
<h4 id="firefox&#x63D2;&#x4EF6;"><a href="#firefox&#x63D2;&#x4EF6;" class="headerlink" title="firefox&#x63D2;&#x4EF6;"></a>firefox&#x63D2;&#x4EF6;</h4><ul>
<li><a href="">onetab</a>&#x3010;&#x6807;&#x7B7E;&#x9875;&#x7BA1;&#x7406;&#x3011;</li>
<li><a href="">firebug</a>&#x3010;&#x8C03;&#x8BD5;&#x4EE3;&#x7801;&#x3011;</li>
<li><a href="">Adblock plus</a>&#x3010;&#x6EE4;&#x9664;&#x5E7F;&#x544A;&#x3011;</li>
<li><a href="">FoxyProxy Standard</a>&#x3010;&#x4EE3;&#x7406;&#x3011;</li>
<li><a href="">NetVideoHunter</a>&#x3010;&#x4E0B;&#x8F7D;&#x9875;&#x9762;&#x4E0A;&#x6B63;&#x64AD;&#x653E;&#x7684;&#x97F3;&#x9891;&#x3011;</li>
<li><a href="">DownThemAll</a>&#x3010;Downthemall &#x662F;Firefox&#x7684;&#x4E00;&#x4E2A;&#x4E0B;&#x8F7D;&#x7BA1;&#x7406;&#x63D2;&#x4EF6;&#x3002;&#x652F;&#x6301;&#x591A;&#x7EBF;&#x7A0B;&#x3001;&#x7EED;&#x4F20;&#x3001;&#x6279;&#x91CF;&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#xFF0C;&#x540C;&#x65F6;&#x5141;&#x8BB8;HTTP&#x548C;FTP&#x534F;&#x8BAE;&#x7684;&#x514D;&#x8D39;&#x8F6F;&#x4EF6;&#x3002;<br>Downthemall &#x652F;&#x6301;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x65B9;&#x4FBF;&#x7684; &#x6279;&#x91CF;&#x751F;&#x6210;&#x56FA;&#x5B9A;&#x683C;&#x5F0F;&#x7684;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#xFF0C;&#x4E5F;&#x80FD;&#x8FC7;&#x6EE4;&#x4E0B;&#x8F7D;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x3011;</li>
</ul>
<h3 id="&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x6574;&#x7406;"><a href="#&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x6574;&#x7406;" class="headerlink" title="&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x6574;&#x7406;"></a>&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x6574;&#x7406;</h3><p>&#x8FD9;&#x4E48;&#x591A;&#x5DE5;&#x5177;&#x3001;&#x63D2;&#x4EF6;&#x4F1A;&#x4E0D;&#x4F1A;&#x5F88;&#x4E71;&#xFF0C;&#x7B54;&#x6848;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x5982;&#x679C;&#x4E0D;&#x5B66;&#x7740;&#x53BB;&#x6574;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x80AF;&#x5B9A;&#x662F;&#x4F1A;&#x4E71;&#x7684;&#x3002;</p>
<p>&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x6211;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7231;&#x6574;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x6BCF;&#x9694;&#x4E00;&#x6BB5;&#x662F;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x4E66;&#x684C;&#xFF0C;&#x8863;&#x67DC;&#xFF0C;&#x6574;&#x7406;&#x8FC7;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x4F1A;&#x89C9;&#x5F97;&#x5FC3;&#x60C5;&#x5927;&#x597D;&#xFF01;</p>
<h4 id="&#x5982;&#x4F55;&#x6574;&#x7406;"><a href="#&#x5982;&#x4F55;&#x6574;&#x7406;" class="headerlink" title="&#x5982;&#x4F55;&#x6574;&#x7406;"></a>&#x5982;&#x4F55;&#x6574;&#x7406;</h4><h5 id="&#x7535;&#x8111;&#x684C;&#x9762;"><a href="#&#x7535;&#x8111;&#x684C;&#x9762;" class="headerlink" title="&#x7535;&#x8111;&#x684C;&#x9762;"></a>&#x7535;&#x8111;&#x684C;&#x9762;</h5><p>&#x7535;&#x8111;&#x684C;&#x9762;&#x6574;&#x7406;&#xFF0C;&#x4E0D;&#x8981;&#x628A;&#x4EC0;&#x4E48;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x56FE;&#x6807;&#x5168;&#x90E8;&#x90FD;&#x6446;&#x5728;&#x684C;&#x9762;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x770B;&#x4E0A;&#x53BB;&#x592A;&#x4E71;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8F6F;&#x4EF6;&#x653E;&#x5230;&#x5F00;&#x59CB;&#x76EE;&#x5F55;&#x5185;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x7684;&#x662F;window10&#x7CFB;&#x7EDF;&#xFF0C;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x53C2;&#x8003;<a href="https://www.zhihu.com/question/32129337" target="_blank" rel="external">&#x5982;&#x4F55;&#x4F18;&#x96C5;&#x5730;&#x4F7F;&#x7528; Windows 10 ?</a></p>
<h5 id="&#x7535;&#x8111;&#x6027;&#x80FD;"><a href="#&#x7535;&#x8111;&#x6027;&#x80FD;" class="headerlink" title="&#x7535;&#x8111;&#x6027;&#x80FD;"></a>&#x7535;&#x8111;&#x6027;&#x80FD;</h5><p>&#x539F;&#x6765;&#x60F3;&#x5728;&#x7F51;&#x4E0A;&#x4E70;&#x5757;&#x56FA;&#x6001;&#x5185;&#x5B58;&#x81EA;&#x5DF1;&#x6362;&#x7684;&#xFF0C;&#x8F6C;&#x5FF5;&#x4E00;&#x60F3;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x8F6F;&#x4EF6;&#x90FD;&#x8981;&#x91CD;&#x88C5;&#xFF0C;&#x5C31;&#x5C1D;&#x8BD5;&#x4E00;&#x7CFB;&#x5217;&#x522B;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x89E3;&#x51B3;&#x7535;&#x8111;&#x7684;&#x5361;&#x6162;&#xFF0C;&#x6BD4;&#x5982;&#x78C1;&#x76D8;&#x6E05;&#x7406;&#xFF0C;&#x589E;&#x52A0;&#x865A;&#x62DF;&#x5185;&#x5B58;&#xFF0C;&#x53BB;&#x9664;&#x4E00;&#x4E9B;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#x2026;&#x4EE5;&#x53CA;&#x66F4;&#x6709;&#x903C;&#x683C;&#x7684;&#x5173;&#x673A;&#x65B9;&#x5F0F;SlideToShutDown,&#x6ED1;&#x4E0B;&#x6765;&#x5373;&#x53EF;&#x5173;&#x673A;</p>
<h5 id="&#x6D4F;&#x89C8;&#x5668;"><a href="#&#x6D4F;&#x89C8;&#x5668;" class="headerlink" title="&#x6D4F;&#x89C8;&#x5668;"></a>&#x6D4F;&#x89C8;&#x5668;</h5><p>&#x6D4F;&#x89C8;&#x5668;&#x6574;&#x7406;&#xFF0C;&#x4E66;&#x7B7E;&#x8981;&#x5206;&#x7C7B;&#xFF0C;&#x914D;&#x5408;&#x4E91;&#x7B14;&#x8BB0;&#x548C;Pocket&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x8981;&#x628A;&#x7F51;&#x9875;&#x90FD;&#x8BBE;&#x7F6E;&#x6210;&#x4E66;&#x7B7E;&#x8FD8;&#x4E0D;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#xFF0C;&#x4E66;&#x7B7E;&#x5C06;&#x81C3;&#x80BF;&#x4E0D;&#x582A;&#xFF01;</p>
<h5 id="&#x4E91;&#x7B14;&#x8BB0;"><a href="#&#x4E91;&#x7B14;&#x8BB0;" class="headerlink" title="&#x4E91;&#x7B14;&#x8BB0;"></a>&#x4E91;&#x7B14;&#x8BB0;</h5><p>&#x4E91;&#x7B14;&#x8BB0;&#x6574;&#x7406;&#xFF0C;&#x6765;&#x4E0D;&#x53CA;&#x770B;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x60F3;&#x5B58;&#x5230;Pocket,&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x8981;&#x91CD;&#x8981;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x4FDD;&#x5B58;&#x5230;&#x4E91;&#x7B14;&#x8BB0;&#xFF0C;&#x4E91;&#x7B14;&#x8BB0;&#xFF0C;&#x5206;&#x7C7B;&#x4EE5;&#x53CA;&#x6807;&#x7B7E;&#x8981;&#x5206;&#x7EA7;&#xFF0C;&#x65B9;&#x4FBF;&#x4EE5;&#x540E;&#x7684;&#x67E5;&#x627E;</p>
<h2 id="&#x79FB;&#x52A8;&#x7AEF;"><a href="#&#x79FB;&#x52A8;&#x7AEF;" class="headerlink" title="&#x79FB;&#x52A8;&#x7AEF;"></a>&#x79FB;&#x52A8;&#x7AEF;</h2><p>&#x987A;&#x4FBF;&#x5B89;&#x5229;&#x4E00;&#x4E9B;&#x624B;&#x673A;&#x7AEF;&#x597D;&#x7528;&#x7684;&#x8F6F;&#x4EF6;:</p>
<ul>
<li><a href="">Via&#x6D4F;&#x89C8;&#x5668;</a>&#x3010;&#x8F7B;&#x5FEB;&#x7B80;&#x6D01;&#xFF0C;200&#x591A;kb&#x5B89;&#x88C5;&#x5305;&#xFF0C;&#x4E00;&#x7528;&#x503E;&#x5FC3;&#xFF0C;&#x4F60;&#x503C;&#x5F97;&#x62E5;&#x6709;&#x3011;</li>
<li><a href="">since</a>&#x3010;&#x4E00;&#x6B3E;&#x7B80;&#x5355;&#x8BB0;&#x5F55;&#x5929;&#x6570;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x3011;</li>
<li><a href="">&#x7F51;&#x6613;&#x4E91;&#x97F3;&#x4E50;</a>&#x3010;&#x6839;&#x636E;&#x4F60;&#x7684;&#x542C;&#x6B4C;&#x504F;&#x597D;&#xFF0C;&#x6BCF;&#x5929;&#x4E3A;&#x4F60;&#x63A8;&#x8350;20&#x9996;&#x6B4C;&#xFF0C;&#x63A8;&#x8350;&#x7684;&#x90FD;&#x8FD8;&#x4E0D;&#x9519;&#x54E6;&#xFF0C;&#x76EE;&#x524D;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x6253;&#x5F00;&#x7F51;&#x6613;&#x4E91;&#x97F3;&#x4E50;&#x6765;&#x542C;&#x6B4C;&#x3011;</li>
<li><a href="">Smooth</a>&#x3010;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5237;&#x5237;&#x5FAE;&#x535A;&#x8FD8;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E0D;&#x5C11;&#x63A5;&#x53E3;&#x4E0D;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x3011;</li>
<li><a href="">&#x6709;&#x9053;&#x8BCD;&#x5178;</a>&#x3010;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x57FA;&#x672C;&#x4E0A;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x7528;&#x5230;&#xFF0C;&#x82F1;&#x8BED;&#x5355;&#x8BCD;&#x67E5;&#x8BE2;&#x5FC5;&#x5907;&#x3011;</li>
</ul>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>坚持原创技术分享，您的支持将鼓励我继续创作！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
        <div id="wechat" style="display: inline-block">
          <img id="wechat_qr" src="/uploads/wechat-reward-image.png" alt="byAlice WeChat Pay"/>
          <p>微信打赏</p>
        </div>
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/uploads/alipay-reward-image.png" alt="byAlice Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/工具/" rel="tag">#工具</a>
          
            <a href="/tags/整理/" rel="tag">#整理</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/11/git-plus/" rel="next" title="Atom 插件git plus如何配置">
                <i class="fa fa-chevron-left"></i> Atom 插件git plus如何配置
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2016/09/10/Tool/"
     data-title="浅谈“知识管理”、“工具收集”以及“开发环境的整理”"
     data-content=""
     data-url="http://byalice.github.io/2016/09/10/Tool/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          

  <p>热评文章</p>
  <div class="ds-top-threads" data-range="weekly" data-num-items="4"></div>


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/10/Tool/"
           data-title="浅谈“知识管理”、“工具收集”以及“开发环境的整理”" data-url="http://byalice.github.io/2016/09/10/Tool/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.jpg"
               alt="byAlice" />
          <p class="site-author-name" itemprop="name">byAlice</p>
          <p class="site-description motion-element" itemprop="description">Since choose far convenient, just trials and hardships!</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">4</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">10</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/byAlice" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/byalice6" target="_blank" title="Twitter">
                  
                    <i class="fa fa-fw fa-twitter"></i>
                  
                  Twitter
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/5423627722?topnav=1&wvr=6&topsug=1&is_hot=1" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.byalice.club/" target="_blank" title="website">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  website
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#知识管理"><span class="nav-number">2.</span> <span class="nav-text">知识管理</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#前端资讯"><span class="nav-number">3.</span> <span class="nav-text">前端资讯</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#PC端"><span class="nav-number">4.</span> <span class="nav-text">PC端</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#小工具"><span class="nav-number">4.1.</span> <span class="nav-text">小工具</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#开发工具"><span class="nav-number">4.2.</span> <span class="nav-text">开发工具</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#浏览器插件"><span class="nav-number">4.3.</span> <span class="nav-text">浏览器插件</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#chrome插件"><span class="nav-number">4.3.1.</span> <span class="nav-text">chrome插件</span></a><ol class="nav-child"><li class="nav-item nav-level-5"><a class="nav-link" href="#常用插件"><span class="nav-number">4.3.1.1.</span> <span class="nav-text">常用插件</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#备用插件"><span class="nav-number">4.3.1.2.</span> <span class="nav-text">备用插件</span></a></li></ol></li><li class="nav-item nav-level-4"><a class="nav-link" href="#firefox插件"><span class="nav-number">4.3.2.</span> <span class="nav-text">firefox插件</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#开发环境整理"><span class="nav-number">4.4.</span> <span class="nav-text">开发环境整理</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#如何整理"><span class="nav-number">4.4.1.</span> <span class="nav-text">如何整理</span></a><ol class="nav-child"><li class="nav-item nav-level-5"><a class="nav-link" href="#电脑桌面"><span class="nav-number">4.4.1.1.</span> <span class="nav-text">电脑桌面</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#电脑性能"><span class="nav-number">4.4.1.2.</span> <span class="nav-text">电脑性能</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#浏览器"><span class="nav-number">4.4.1.3.</span> <span class="nav-text">浏览器</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#云笔记"><span class="nav-number">4.4.1.4.</span> <span class="nav-text">云笔记</span></a></li></ol></li></ol></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#移动端"><span class="nav-number">5.</span> <span class="nav-text">移动端</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  3-6 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">byAlice</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io" rel="external nofollow">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next" rel="external nofollow">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>











  
  <script type="text/javascript" src="http://cdn.bootcss.com/jquery/2.1.3/jquery.min.js"></script>

  
  <script type="text/javascript" src="http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js"></script>

  
  <script type="text/javascript" src="http://cdn.bootcss.com/jquery.lazyload/1.9.1/jquery.lazyload.min.js"></script>

  
  <script type="text/javascript" src="http://cdn.bootcss.com/velocity/1.2.1/velocity.min.js"></script>

  
  <script type="text/javascript" src="http://cdn.bootcss.com/velocity/1.2.1/velocity.ui.min.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"byalice"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("Si3K4wguDf7l71IK62N4wbDS-gzGzoHsz", "GBYFnMdOSiQakeNYEGn2yq4j");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
